Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolygonalSurfaceHandle
Represents a handle that is represented as a polygonal surface on the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolygonalSurfaceHandle.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IFaceHandle)
Creates an instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolygonalSurfaceHandle class.
nativeHandle: Underlying DM handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolygonalSurfaceHandle.WrappedHandle
Gets the underlying face handle.

Tekla.Structures.Plugins.DirectManipulation.Services.Handles.PolygonalSurfaceHandle.Contour
Gets the contour of the surface that the handle represents.
Remarks:
If the contour is set, the minimum number of points is 3 and all of the points must be contained in the
same plane.